{
	"newsList": [
		{
			"teaser": "Trump orders killing of key Iranian commander in Baghdad airport strike",
			"article": [
				"President Donald Trump ordered an airstrike at Baghdad International Airport that killed Qasem Soleimani, a key Iranian military commander, in a decisive defensive action to protect US personnel abroad that was intended to deter future Iranian attack plans, the Pentagon confirmed Thursday.",
				"Soleimani, the head of Iran's Islamic Revolutionary Guards Corps (IRGC) Quds Force unit, and Abu Mahdi al-Muhandis, the deputy head of the Iran-backed Iraqi Popular Mobilization Forces (PMF), were among those killed in the attack early Friday morning local time, according to a statement from the PMF, which said the pair were martyred by an American strike.",
				"Formed in 2014 to fight ISIS, the PMF is a Shia paramilitary force made up of former militias with close ties to Iran. It was recognized under a 2016 Iraqi law as an independent military force that answers directly to the prime minister.",
				"Soleimani and his Quds Force were responsible for the deaths of hundreds of American and coalition service members, and the wounding of thousands more, the Pentagon added. The Pentagon also blamed the Iranian general for orchestrating attacks on coalition bases in Iraq in recent months, including an attack on December 27 that culminated in the deaths of an American contractor and Iraqi personnel."
			]
		},
		{
			"teaser": "Australian military embark on rescue missions as deadly wildfires threaten to burn towns to the ground",
			"article": [
				"Australian authorities are launching naval and air rescue operations along the country's southeast coast as deadly wildfires intensify, stranding residents and tourists in towns that may be wiped out by Saturday.",
				"The Australian Defence Force (ADF) sent navy vessels on Friday to the fire-threatened town of Mallacoota, in Victoria state, where thousands of people fled their homes and sought refuge on a beach earlier this week. More than 960 people will be evacuated on Friday to Western Port, south of Melbourne, the ADF said.",
				"Photos from Mallacoota show people wearing face masks and lining up to board the vessels, with the air blanketed in yellow haze and smoke.",
				"Authorities in neighboring New South Wales state are also urging residents to abandon entire towns that lie in the path of intensifying fires. Already, some towns have been virtually burned to the ground, across NSW, 1,365 homes have been destroyed and more than 500 damaged this fire season."
			]
		},
		{
			"teaser": "Julian Castro drops out of presidential race",
			"article": [
				"Julian Castro ended his presidential campaign on Thursday after the former Housing and Urban Development secretary failed to gain traction in the large field of Democratic candidates.",
				"Castro announced the news in a video posted on Twitter.",
				"The Castro campaign appeared to be nearing the end for months, as the candidate struggled to raise enough money to stay solvent as a host of his Democratic opponents continued surging.",
				"Castro closed out his campaign by lobbing broader complaints at the Democratic Party about the fact that Iowa and New Hampshire, two predominantly white states that do not reflect the broader Democratic electorate, vote first in the nominating process."
			]
		},
		{
			"teaser": "Photos reveal extensive damage to US Embassy in Baghdad",
			"article": [
				"An uneasy calm enveloped the U.S. Embassy in Iraq on Thursday as new images from the scene revealed extensive damage following days of sometimes violent protests by Iranian-backed militia members and their supporters.",
				"The Pentagon said it was sending hundreds of troops to the region, and Secretary of State Mike Pompeo would delay a trip to Central Asia to focus on the situation in Baghdad.",
				"Defense Secretary Mark Esper said 750 soldiers were immediately deploying. At Fort Bragg in North Carolina, hundreds of paratroopers boarded C-17 aircraft bound for the region as part as the Immediate Response Force.",
				"Demonstrators began to disperse Wednesday in the second day of unrest after U.S. airstrikes killed at least two dozen Iran-backed fighters in Iraq."
			]
		},
		{
			"teaser": "4.0 quake hits near Oxnard, California",
			"article": [
				"A magnitude 4.0 earthquake was reported at 2:13 a.m. Thursday 13 miles from Oxnard, California, according to the U.S. Geological Survey.",
				"The earthquake occurred 14 miles from Port Hueneme, 19 miles from Malibu, 20 miles from Thousand Oaks and 20 miles from Camarillo.",
				"In the past 10 days, there have been three earthquakes of magnitude 3.0 or greater centered nearby.",
				"An average of 234 earthquakes with magnitudes between 3.0 and 4.0 occur per year in California and Nevada, according to a recent three year data sample."
			]
		},
		{
			"teaser": "Taiwan military chief among 8 people killed in Black Hawk helicopter crash",
			"article": [
				"Taiwan's top military official was among eight people killed on Thursday when their Black Hawk helicopter crashed in mountains in the north of the island.",
				"Gen. Shen Yi-ming, 62, the Taiwan military's chief of general staff, was en route to visit troops when the UH-60M helicopter disappeared from radar near New Taipei City while carrying 13 people, including the crew.",
				"Shen was confirmed dead along with seven other people on board, Lt. Gen. Hsiung Hou-chi of Taiwan's air force told a news conference Thursday afternoon. Five people survived.",
				"The helicopter lost contact with base 13 minutes after taking off, at 8:07 a.m. local time, Hsiung said. He added the helicopter's' condition was not ideal, and the ministry had set up a task force to investigate the cause of the incident."
			]
		},
		{
			"teaser": "Shanghai stocks pop on first day of trading in 2020",
			"article": [
				"Markets in Shanghai and Hong Kong rose Thursday after China announced that it will take more action to bolster its slowing economy.",
				"The Shanghai Composite (SHCOMP) advanced nearly 1.3% on the first trading day of 2020. Hong Kong's' Hang Seng Index (HSI) gained 1%.",
				"South Korea's Kospi (KOSPI), meanwhile, fell 1.1%. Japanese markets remained closed for the New Year holidays and will reopen next Monday.",
				"The People's Bank of China announced Wednesday that it will once again reduce the amount of cash banks have to keep in reserve. It is cutting the reserve requirement ratio for most financial institutions by 50 basis points — the first time it has done so since September."
			]
		},
		{
			"teaser": "Hong Kong protest fallout hits HSBC and the London Stock Exchange",
			"article": [
				"Two of the United Kingdom's leading financial institutions are being caught up in the political fallout from months of pro-democracy protests in Hong Kong.",
				"Protesters in the former British colony attacked some branches of HSBC (HBCYF) this week and daubed red paint on a pair of bronze lions outside the bank's Hong Kong headquarters. HSBC, the largest bank in the city, has been accused of working with Chinese authorities to cut off funding for the protesters.",
				"HSBC has denied those allegations and condemned what it described as repeated acts of vandalism against its branches. It said in a statement on Thursday that it was working to restore ATM and other banking services that had been suspended as a result of the attacks.",
				"Meanwhile, the London Stock Exchange (LDNXF) is at risk of losing Chinese business because of Beijing's anger at Britain's stance on the protests in Hong Kong. Citing multiple sources, Reuters reported that a partnership between the London and Shanghai stock exchanges was being suspended because of political tension."
			]
		}
	]
}
